Repository: pingfangx/TranslatorX-other
Catalog: GitDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Remove all lines matching the key from config file.
zh_cn: 从配置文件中移除与 key 匹配的所有行。

source: Remove all the stash entries.
zh_cn: 移除所有的储藏条目。

source: Remove extra objects that are already in pack files
zh_cn: 移除已经在包文件中的额外的对象

source: Remove files from the index, or from the working tree and the index.
zh_cn: 从索引中删除文件，或从工作树和索引中删除文件。

source: Remove files from the working tree and from the index
zh_cn: 从工作树和索引中移除文件

source: Remove only files ignored by Git.
zh_cn: 移除 Git 忽略的文件。

source: Remove the given section from the configuration file.
zh_cn: 从配置文件中移除给定的部分。

source: Remove the line matching the key from config file.
zh_cn: 从配置文件中移除与 key 匹配的行。

source: Remove the remote named <name>.
zh_cn: 移除名为<name>的远程。

source: Remove unnecessary whitespace
zh_cn: 移除不必要的空格

source: Remove untracked directories in addition to untracked files.
zh_cn: 移除未跟踪的目录以及未跟踪的文件。

source: Remove untracked files from the working tree
zh_cn: 从工作树中移除未跟踪的文件

source: Removed content is represented by lines beginning with "-".
zh_cn: 已移除的内容由以"-"开头的行表示。

source: Removes all *.txt files from the index that are under the Documentation directory and any of its subdirectories.
zh_cn: 从索引中删除 Documentation 目录及其任何子目录下的所有 *.txt 文件。

source: Rename the given section to a new name.
zh_cn: 将给定的部分重命名为新名称。

source: Rename the remote named <old> to <new>.
zh_cn: 将名为<old>的远程重命名为<new>。

source: Reordering or selecting from a patch series
zh_cn: 从补丁系列重新排序或选择

source: Replace an existing tag with the given name (instead of failing)
zh_cn: 用给定的名称替换现有的标签(而不是失败)

source: Replace the tip of the current branch by creating a new commit.
zh_cn: 通过创建新的提交来替换当前分支的顶部。

source: Report bugs to the Git mailing list <git@vger.kernel.org> where the development and maintenance is primarily done.
zh_cn: 向 Git 邮件列表报告错误 <git@vger.kernel.org> ，其主要完成开发和维护。

source: Report the names of files as they are moved.
zh_cn: 报告移动文件的名称。

source: Reporting Bugs
zh_cn: 报告错误

source: Reports its object ID to its standard output.
zh_cn: 将其对象 ID 报告给其标准输出。

source: Repositories and Branches
zh_cn: 仓库和分支

source: Repository Administration
zh_cn: 仓库管理

source: Repository maintenance
zh_cn: 仓库维护

source: Repository specific configuration file.
zh_cn: 仓库特定的配置文件。

source: Reset <branchname> to <startpoint> if <branchname> exists already.
zh_cn: 如果<branchname>已经存在，将<branchname>重置为<startpoint>。

source: Reset a single file in the index
zh_cn: 重置索引中的单个文件

source: Reset current HEAD to the specified state
zh_cn: 将当前 HEAD 重置到指定状态

source: Resets index entries and updates files in the working tree that are different between <commit> and HEAD.
zh_cn: 重置索引条目并更新工作树中与<commit>和 HEAD 不同的文件。

source: Resets the index and updates the files in the working tree that are different between <commit> and HEAD, but keeps those which are different between the index and working tree (i.e. which have changes which have not been added).
zh_cn: 重置索引并更新工作树中不同于<commit>和 HEAD 之间的文件，但保留索引和工作树之间不同的文件(即哪些具有尚未添加的更改)。

source: Resets the index and working tree.
zh_cn: 重置索引和工作树。

source: Resets the index but not the working tree (i.e., the changed files are preserved but not marked for commit) and reports what has not been updated.
zh_cn: 重置索引但不重置工作树(即，更改的文件被保留但未标记为提交)，并报告尚未更新的内容。

source: Resolving a merge
zh_cn: 解决合并

source: Respect include.* directives in config files when looking up values.
zh_cn: 查找值时，在配置文件中尊重 include.* 指令。

source: Restart the rebasing process after having resolved a merge conflict.
zh_cn: 解决了合并冲突后重新启动 rebase 过程。

source: Restricted login shell for Git-only SSH access
zh_cn: 限制登录 shell，仅限 Git SSH 访问

source: Retrieve and store user credentials
zh_cn: 检索和存储用户凭据

source: Returns error code 1 if no value is found.
zh_cn: 如果没有找到值，则返回错误代码1。

source: Returns error code 1 if the key was not found and the last value if multiple key values were found.
zh_cn: 如果找不到键，则返回错误代码1，如果找到多个键值，则返回最后一个值。

source: Reuse recorded resolution of conflicted merges
zh_cn: 复用记录的合并冲突时的解决方式

source: Revert some existing commits
zh_cn: 恢复一些现有的提交

source: Revert the changes done by commits from the fifth last commit in master (included) to the third last commit in master (included), but do not create any commit with the reverted changes.
zh_cn: 将 master 中倒数第五个提交(包括)到倒数第三个提交之前的提交所做的更改还原，但不要创建任何具有还原更改的提交。

source: Revert the changes specified by the fourth last commit in HEAD and create a new commit with the reverted changes.
zh_cn: 恢复 HEAD 中第四次提交指定的更改，并创建一个带有还原更改的新提交。

source: Reverting new paths makes them untracked.
zh_cn: 恢复新的路径使它们未被追踪。

source: Revision Range Summary
zh_cn: 修订范围摘要

source: Rewrite branches
zh_cn: 重写分支

source: Rewriting a single commit
zh_cn: 重写单个提交

source: Rewriting history and maintaining patch series
zh_cn: 重写历史并维护补丁系列

source: Routines to help parsing remote repository access parameters
zh_cn: 帮助解析远程仓库访问参数的例程

source: Run a merge for files needing merging
zh_cn: 为需要合并的文件运行合并

source: Run a three-way file merge
zh_cn: 运行三路文件合并

source: Run as if git was started in <path> instead of the current working directory.
zh_cn: 在 <path> 中启动 git，而不是当前的工作目录。

source: Run merge conflict resolution tools to resolve merge conflicts
zh_cn: 运行合并冲突解决工具来解决合并冲突

source: Run verbosely.
zh_cn: 详细地运行。

source: Running "git tag" without arguments also lists all tags.
zh_cn: 运行没有参数的 "git tag" 也会列出所有标签。

source: Running git init in an existing repository is safe.
zh_cn: 在现有仓库中运行 git init 是安全的。

source: Runs a number of housekeeping tasks within the current repository, such as compressing file revisions (to reduce disk space and increase performance) and removing unreachable objects which may have been created from prior invocations of git add.
zh_cn: 在当前存储库中运行多个内务任务，例如压缩文件修订版(减少磁盘空间并提高性能)，并删除可能从以前的调用 git add 创建的不可访问对象。

source: SECURITY
zh_cn: 安全

source: SEE ALSO
zh_cn: 也可以看看

source: SEPARATE CHANGES
zh_cn: 分开更改

source: SEQUENCER SUBCOMMANDS
zh_cn: 顺序子命令

source: SHA-1 names of tags of interest are stored under ref/tags/.
zh_cn: 感兴趣标签的 SHA-1 名称存储在 ref/tags/ 下。

source: SPECIFYING RANGES
zh_cn: 指定范围

source: SPECIFYING REVISIONS
zh_cn: 指定版本

source: SPLITTING COMMITS
zh_cn: 分割提交

source: SUBMODULES
zh_cn: 子模块

source: SYNOPSIS
zh_cn: 概要

source: Salvage your data out of another SCM people love to hate
zh_cn: 从另一个人们喜欢或讨厌的 SCM 中抢救你的数据

source: Same as strip except #commentary is not removed.
zh_cn: 与 strip 相同，除了 #commentary 不会被删除。

source: Same as strip if the message is to be edited.
zh_cn: 如果要编辑消息，则与 strip 相同。

source: Same as whitespace except that everything from (and including) the line found below is truncated, if the message is to be edited.
zh_cn: 与 whitespace 相同，只是如果要编辑消息，那么从(和包含)下面找到的行将被截断。

source: Same as above.
zh_cn: 与上述相同。

source: Save your local modifications to a new stash entry and roll them back to HEAD (in the working tree and in the index).
zh_cn: 将您的本地修改保存到一个新的 stash entry ，并将其回滚到 HEAD(在工作树和索引中)。

source: Search entire site...
zh_cn: 搜索整个网站...

source: Second user-specific configuration file.
zh_cn: 第二个用户特定的配置文件。

source: See "SPECIFYING REVISIONS" section in gitrevisions[7] for a more complete list of ways to spell blob names.
zh_cn: 请参阅 gitrevisions[7] 中的"指定版本"部分，以获取更完整的拼写名称拼写方式列表。

source: See git-add[1].
zh_cn: 参见 git-add[1] 。

source: See git-config[1] for a list and more details about the configuration mechanism.
zh_cn: 有关配置机制的详细信息，请参见 git-config[1] 。

source: See git-help[1] for more information, because git --help ... is converted internally into git help ....
zh_cn: 请参阅 git-help[1] 了解更多信息，因为 git --help ... 内部转换为 git help ... 。

source: See git-merge[1]
zh_cn: 参见 git-merge[1]

source: See git-merge[1] for some hints on resolving such conflicts.
zh_cn: 有关解决此类冲突的一些提示，请参见 git-merge[1] 。

source: See git-replace[1] for more information.
zh_cn: 有关详细信息，请参阅 git-replace[1] 。

source: See git-status[1] for details.
zh_cn: 详见 git-status[1] 。

source: See git-update-index[1] for more information.
zh_cn: 有关详细信息，请参阅 git-update-index[1] 。

source: See git[1] for details.
zh_cn: 详见 git[1] 。

source: See gitnamespaces[7] for more details.
zh_cn: 详见 gitnamespaces[7] 。

source: See gitrepository-layout[5] and git-worktree[1] for details.
zh_cn: 详见 gitrepository-layout[5] 和 git-worktree[1] 。

source: See gittutorial[7] to get started, then see giteveryday[7] for a useful minimum set of commands.
zh_cn: 请参阅 gittutorial[7] 开始使用，然后参阅 giteveryday[7] 获取有用的最小命令集。

source: See gitworkflows[7] for an overview of recommended workflows.
zh_cn: 有关推荐工作流程的概述，请参见 gitworkflows[7] 。

source: See git-config[1] for more details.
zh_cn: 有关详细信息，请参阅 git-config[1] 。

source: See git-log[1].
zh_cn: 参见 git-log[1] 。

source: See git-rebase[1] for details.
zh_cn: 详见 git-rebase[1] 。

source: See gitignore[5].
zh_cn: 参见 gitignore[5] 。

source: See git-fetch[1].
zh_cn: 参见 git-fetch[1] 。

source: See git-reflog[1] for details.
zh_cn: 有关详细信息，请参见 git-reflog[1] 。

source: See gitrevisions[7] for more details.
zh_cn: 详见 gitrevisions[7] 。

source: See git-var[1] for details.
zh_cn: 有关详细信息，请参见 git-var[1] 。

source: See git-web{litdd}browse[1] for more information about this.
zh_cn: 有关详细信息，请参阅 git-web{litdd}browse[1] 。

source: See githooks[5] for more information.
zh_cn: 有关详细信息，请参阅 githooks[5] 。

source: See GIT_TRACE for available trace output options.
zh_cn: 有关可用的跟踪输出选项，请参见 GIT_TRACE 。

source: See pull.rebase, branch.<name>.rebase and branch.autoSetupRebase in git-config[1] if you want to make git pull always use --rebase instead of merging.
zh_cn: 如果你想让 git pull 总是使用 --rebase 而不是合并，参见 git-config[1] 中的 pull.rebase, branch.<name>.rebase 和 branch.autoSetupRebase 。

source: See --create-reflog above for details.
zh_cn: 详见上方的 --create-reflog 。

source: See History Simplification below for details and other simplification modes.
zh_cn: 请参阅下面的 历史简化 和其他简化模式。

source: See <refspec> in the OPTIONS section above for a description of "matching" branches.
zh_cn: 有关"匹配"分支的说明，请参阅上述 OPTIONS 部分中的<refspec>。

source: See EDITING PATCHES below.
zh_cn: 见下面的编辑补丁。

source: See also Appendix A: Git Quick Reference for a brief overview of Git commands, without any explanation.
zh_cn: 参见 附录 A：Git 快速参考 查看 Git 命令的简要概述，无任何解释。

source: See also FILES.
zh_cn: 另见 FILES 。

source: See also githooks[5].
zh_cn: 另见 githooks[5] 。

source: See also git-var[1] and the core.editor option in git-config[1].
zh_cn: 另请参见 git-config[1] 中的 git-var[1] 和 core.editor 选项。

source: See also git-fetch[1].
zh_cn: 另请参见 git-fetch[1] 。

source: See also RECOVERING FROM UPSTREAM REBASE below.
zh_cn: 参见下面从上游变基恢复。

source: See also the howto documents for some useful examples.
zh_cn: 另请参阅 howto 文档中的一些有用的例子。

source: See also the core.askPass option in git-config[1].
zh_cn: 另请参见 git-config[1] 中的 core.askPass 选项。

source: See also the core.pager option in git-config[1].
zh_cn: 另请参见 git-config[1] 中的 core.pager 选项。

source: See also the prune subcommand of git-remote[1] for a way to clean up all obsolete remote-tracking branches.
zh_cn: 另请参阅 git-remote[1] 的 prune 子命令，以清理所有过时的远程跟踪分支。

source: See below for an illustration of the usage of this form.
zh_cn: 有关此形式的用法的说明，请参见下文的例证。

source: See documentation for git-receive-pack[1].
zh_cn: 请参阅 git-receive-pack[1] 的文档。

source: See section "Alternate terms" below for more information.
zh_cn: 有关详细信息，请参阅下面的"备用术语"部分。

source: See the "PRETTY FORMATS" section for some additional details for each format.
zh_cn: 有关每种格式的其他详细信息，请参阅"PRETTY FORMATS"一节。

source: See the commit.verbose configuration variable in git-config[1].
zh_cn: 请参阅 git-config[1] 中的 commit.verbose 配置变量。

source: See the <refspec>... section above for details.
zh_cn: 有关详细信息，请参阅上面的 <refspec>... 部分。

source: See the description of protocol.allow in git-config[1] for more details.
zh_cn: 有关详细信息，请参阅 git-config[1] 中 protocol.allow 的描述。

source: See the documentation for each of those options for details.
zh_cn: 有关详细信息，请参阅每个选项的文档。

source: See the documentation of each command for whether paths are relative to the current directory or toplevel.
zh_cn: 请参阅每个命令的文档，了解路径是否相对于当前目录或顶级。

source: See the references in the "description" section to get started using Git.
zh_cn: 请参阅"说明"部分中的引用来开始使用 Git 。

source: See the “Interactive Mode” section of git-add[1] to learn how to operate the --patch mode.
zh_cn: 请参阅 git-add[1] 的“交互模式”部分，了解如何操作 --patch 模式。

source: See the “Interactive Mode” section of git-add[1] to learn how to operate these modes.
zh_cn: 请参阅 git-add[1] 的“交互模式”部分，了解如何操作这些模式。

source: See “Interactive mode” for details.
zh_cn: 详情请参阅“交互模式”。

source: Send a collection of patches as emails
zh_cn: 发送一组补丁作为电子邮件

source: Send a collection of patches from stdin to an IMAP folder
zh_cn: 将一些补丁从 stdin 发送到 IMAP 文件夹

source: Send archive back to git-archive
zh_cn: 将存档发回 git-archive

source: Send objects packed back to git-fetch-pack
zh_cn: 将对象发送回 git-fetch-pack

source: Sending
zh_cn: 发出

source: Server Admin
zh_cn: 服务器管理

source: Server side implementation of Git over HTTP
zh_cn: 服务器端通过 HTTP 实现 Git

source: Set a configuration variable in the newly-created repository; this takes effect immediately after the repository is initialized, but before the remote history is fetched or any files checked out.
zh_cn: 在新创建的存储库中设置配置变量;这在存储库初始化之后，但在获取远程历史记录或任何文件签出之前立即生效。

source: Set a prefix which gives a path from above a repository down to its root.
zh_cn: 设置一个前缀，该前缀从仓库上方到达根目录。

source: Set the Git namespace.
zh_cn: 设置 Git 命名空间。

source: Set the Git namespace; see gitnamespaces[7] for details.
zh_cn: 设置 Git 命名空间;详见 gitnamespaces[7]

source: Set the path to the repository.
zh_cn: 设置仓库的路径。

source: Set the path to the root of the working tree.
zh_cn: 将路径设置为工作树的根。

source: Set the path to the working tree.
zh_cn: 设置工作树的路径。

source: Set to 0 to prevent protocols used by fetch/push/clone which are configured to the user state.
zh_cn: 设置为 0 以防止被配置为 user 状态的协议用于 fetch/push/clone 。

source: Set up a mirror of the source repository.
zh_cn: 设置源仓库的镜像。

source: Sets of commits can also be given but no traversal is done by default, see git-rev-list[1] and its --no-walk option.
zh_cn: 也可以给出提交集，但默认情况下不进行遍历，请参见 git-rev-list[1] 及其 --no-walk 选项。

source: Sets or deletes the default branch (i.e. the target of the symbolic-ref refs/remotes/<name>/HEAD) for the named remote.
zh_cn: 设置或删除命名的远程的默认分支(即 symbolic-ref refs/remotes/<name>/HEAD 的目标)。

source: Setting gc.autoPackLimit to 0 disables automatic consolidation of packs.
zh_cn: 将 gc.autoPackLimit 设置为 0 将禁用包的自动合并。

source: Setting the mergetool.keepBackup configuration variable to false causes git mergetool to automatically remove the backup as files are successfully merged.
zh_cn: 将 mergetool.keepBackup 配置变量设置为 false 会导致 git mergetool 在文件成功合并时自动移除备份。

source: Setting the value of gc.auto to 0 disables automatic packing of loose objects.
zh_cn: 将 gc.auto 的值设置为 0 将禁用自动打包松散的对象。

source: Setting this variable to 1 will cause Git to treat all pathspecs as case-insensitive.
zh_cn: 将此变量设置为 1 将导致 Git 将所有路径选项视为不区分大小写。

source: Setting this variable to 1 will cause Git to treat all pathspecs as glob patterns (aka "glob" magic).
zh_cn: 将此变量设置为 1 将导致 Git 将所有 pathspecs 视为 glob 模式(又称"glob"魔术)。

source: Setting this variable to 1 will cause Git to treat all pathspecs as literal (aka "literal" magic).
zh_cn: 将此变量设置为 1 将导致 Git 将所有 pathspecs 视为文字（也称为"文字"魔术）。

source: Setting this variable to 1 will cause Git to treat all pathspecs literally, rather than as glob patterns.
zh_cn: 将此变量设置为 1 将导致 Git 以字面方式处理所有的路径，而不是以 glob 模式。

source: Setting up a public repository
zh_cn: 设置公共仓库

source: Setting up a shared repository
zh_cn: 设置共享仓库

source: Setup and Config
zh_cn: 设置与配置

source: Several subcommands are available to perform operations on the remotes.
zh_cn: 有几个子命令可用于对远程执行操作。

source: Sharing and Updating Projects
zh_cn: 项目分享与更新

source: Sharing development with others
zh_cn: 与他人分享开发

source: Sharing your changes
zh_cn: 分享你的更改

source: Shortcut for --delete --force.
zh_cn: --delete --force 的快捷方式。

source: Shortcut for --move --force.
zh_cn: --move --force 的快捷键。

source: Show a Git logical variable
zh_cn: 显示一个 Git 逻辑变量

source: Show all commits since version v2.6.12 that changed any file in the include/scsi or drivers/scsi subdirectories
zh_cn: 显示从 v2.6.12 版本以来的，更改 include/scsi 或 drivers/scsi 子目录中任何文件的所有提交

source: Show branches and their commits
zh_cn: 显示分支及其提交

source: Show brief usage of interactive git-clean.
zh_cn: 显示交动 git-clean 的简要使用。

source: Show cached files in the output (default)
zh_cn: 在输出中显示缓存文件(默认)

source: Show canonical names and email addresses of contacts
zh_cn: 显示联系人的规范名称和电子邮件地址

source: Show changes between commits, commit and working tree, etc
zh_cn: 显示提交之间，提交和工作树之间等的更改

source: Show changes between the working tree and the index or a tree, changes between the index and a tree, changes between two trees, changes between two blob objects, or changes between two files on disk.
zh_cn: 显示工作树和索引或树之间的更改，索引和树之间的更改，两个树之间的更改，两个 blob 对象之间的更改或两个文件在磁盘上的更改。

source: Show changes using common diff tools
zh_cn: 使用常见的差异工具显示更改

source: Show commit logs
zh_cn: 显示提交日志

source: Show deleted files in the output
zh_cn: 在输出中显示已删除的文件

source: Show ignored files as well.
zh_cn: 也显示忽略的文件。

source: Show information about files in the index and the working tree
zh_cn: 显示索引和工作树中的文件信息

source: Show logs with difference each commit introduces
zh_cn: 显示每个提交的差异的日志

source: Show modified files in the output
zh_cn: 在输出中显示已修改的文件

source: Show only commits that are enough to explain how the files that match the specified paths came to be.
zh_cn: 仅显示足以解释与指定路径匹配的文件的提交。

source: Show only ignored files in the output.
zh_cn: 在输出中仅显示被忽略的文件。

source: Show only modification, rename, and copy, but not addition or deletion.
zh_cn: 仅显示修改，重命名和复制，但不显示添加或删除。

source: Show only names and the nature of change, but not actual diff output.
zh_cn: 仅显示名称和更改的性质，但不显示实际的差异输出。

source: Show other (i.e. untracked) files in the output
zh_cn: 在输出中显示其他(即未跟踪)文件

source: Show packed archive index
zh_cn: 显示打包的归档索引

source: Show staged contents' mode bits, object name and stage number in the output.
zh_cn: 在输出中显示暂存内容的模式位，对象名称和阶段编号。

source: Show the branch and tracking info even in short-format.
zh_cn: 以短格式显示分支和跟踪信息。

source: Show the changes during the last two weeks to the file gitk.
zh_cn: 将最近两周内的对文件 gitk 的更改。

source: Show the changes recorded in the stash entry as a diff between the stashed contents and the commit back when the stash entry was first created.
zh_cn: 将储藏条目中记录的更改，显示为已存储的内容和当存储空间条目首次创建时的提交后的差异。

source: Show the commits that are in the "test" branch but not yet in the "release" branch, along with the list of paths each commit modifies.
zh_cn: 显示“test”分支中尚未在“release”分支中的提交，以及每个提交修改的路径列表。

source: Show the number of entries currently stashed away.
zh_cn: 显示当前被暂存的条目数。

source: Show the whole commit history, but skip any merges
zh_cn: 显示整个提交历史记录，但跳过任何合并

source: Show the working tree status
zh_cn: 显示工作树状态

source: Show three-way merge without touching index
zh_cn: 显示三向合并而不用触摸索引

source: Show unified diff between the HEAD commit and what would be committed at the bottom of the commit message template to help the user describe the commit by reminding what changes the commit has.
zh_cn: 在 HEAD 提交和提交消息模板底部提交的内容之间显示统一的差异，以帮助用户通过提醒提交所做的更改来描述提交。

source: Show untracked files.
zh_cn: 显示未跟踪的文件。

source: Show various types of objects
zh_cn: 显示各种类型的对象

source: Show what revision and author last modified each line of a file
zh_cn: 显示文件每一行的最后一次修订版本和作者

source: Show what would be done and clean files interactively.
zh_cn: 以交互方式显示将要完成的操作和清除文件。

source: Show what would be done, without making any changes.
zh_cn: 显示将做什么，但不做任何更改。

source: Showing commits unique to a given branch
zh_cn: 显示给定分支唯一的提交

source: Shows all commits that are in any of local branches but not in any of remote-tracking branches for origin (what you have that origin doesn’t).
zh_cn: 显示所有本地分支中的所有提交，但不包括任何 origin 的远程跟踪分支中(您有的但 origin 没有的)。

source: Shows all commits that are in local master but not in any remote repository master branches.
zh_cn: 显示本地 master 中的所有提交，但不在任何远程仓库的 master 分支。

source: Shows how the function main() in the file main.c evolved over time.
zh_cn: 显示文件 main.c 中的函数 main() 随着时间的推移而发展。

source: Shows one or more objects (blobs, trees, tags and commits).
zh_cn: 显示一个或多个对象(blobs，树，标签和提交)。

source: Shows the commit logs.
zh_cn: 显示提交日志。

source: Shows the commits that changed builtin/rev-list.c, including those commits that occurred before the file was given its present name.
zh_cn: 显示更改 builtin/rev-list.c 的提交，包括在文件被赋予其现有名称之前发生的提交。

source: Shows the contents of the file Documentation/README as they were current in the 10th last commit of the branch next.
zh_cn: 显示文件 Documentation/README 的内容，在分支 next 当前提交之前第10次提交。

source: Shows the history including change diffs, but only from the “main branch” perspective, skipping commits that come from merged branches, and showing full diffs of changes introduced by the merges.
zh_cn: 显示历史，包括变化差异，但仅从“主分支”的角度，忽略来自合并分支的提交，并显示合并引入的变化的完全差异。

source: Shows the subject of the commit pointed to by the tag v1.0.0.
zh_cn: 显示标签 v1.0.0 指定的提交的主题。

source: Shows the tag v1.0.0, along with the object the tags points at.
zh_cn: 显示标签 v1.0.0 ，以及标签指向的对象。

source: Shows the tree pointed to by the tag v1.0.0.
zh_cn: 显示标签 v1.0.0 指向的树。

source: Similar to --file but use the given blob instead of a file.
zh_cn: 与 --file 类似，但使用给定的 blob 而不是文件。

source: Similarly, one can modify "+" lines for existing additions or modifications.
zh_cn: 类似地，可以修改现有添加或修改的"+"行。

source: Simple UNIX mbox splitter program
zh_cn: 简单的 UNIX mbox 分割程序

source: Skip number commits before starting to show the commit output.
zh_cn: 在开始显示提交输出之前跳过 number 条。

source: Skip move or rename actions which would lead to an error condition.
zh_cn: 跳过移动或重命名可能导致错误状态的操作。

source: Small fixups like bumping release/version name would be acceptable.
zh_cn: 小修复，如碰撞释放/版本名称将是可以接受的。

source: Some exit codes are:
zh_cn: 一些退出代码是：

source: Some git commands may automatically run git gc; see the --auto flag below for details.
zh_cn: 一些 git 命令可以自动运行 git gc ;有关详细信息，请参阅下面的 --auto 标志。

source: Some git commands run git gc --auto after performing operations that could create many loose objects.
zh_cn: 执行可能创建许多松散对象的操作后，一些 git 命令会运行 git gc --auto 。

source: Some of these checks may restrict the characters allowed in a branch name.
zh_cn: 其中一些检查可能会限制分支名称中允许的字符。

source: Some of these checks may restrict the characters allowed in a tag name.
zh_cn: 其中一些检查可能会限制标签名称中允许的字符。

source: Some strategies can also take their own options, which can be passed by giving -X<option> arguments to git merge and/or git pull.
zh_cn: 某些策略也可以采用自己的选项，通过将 -X<option> 参数赋值给 git merge 和/或 git pull 。

source: Some variables may appear multiple times; we say then that the variable is multivalued.
zh_cn: 一些变量可能会出现多次;那么我们说这个变量是多值的。

source: Some workflows require that one or more branches of development on one machine be replicated on another machine, but the two machines cannot be directly connected, and therefore the interactive Git protocols (git, ssh, http) cannot be used.
zh_cn: 一些工作流程要求在一台机器上的一个或多个开发分支复制在另一台机器上，但是两台机器无法直接连接，因此不能使用交互式 Git 协议(git，ssh，http)。

source: Sometimes you are only interested in parts of the history, for example the commits modifying a particular <path>.
zh_cn: 有时您只对历史的部分感兴趣，例如修改特定<path>的提交。

source: Sort based on the key given.
zh_cn: 根据给定的键进行排序。

source: Sorting and filtering branches are case insensitive.
zh_cn: 排序和过滤分支不区分大小写。

source: Sorting and filtering tags are case insensitive.
zh_cn: 排序和过滤标签不区分大小写。

source: Specifies which refs to fetch and which local refs to update.
zh_cn: 指定要获取的引用和更新哪些本地引用。

source: Specify a web browser that may be used by some commands.
zh_cn: 指定某些命令可能使用的 Web 浏览器。

source: Specify an explicit author using the standard A U Thor <author@example.com> format.
zh_cn: 使用标准的 A U Thor <author@example.com> 格式指定一个明确的作者。

source: Specify the directory from which templates will be used; (See the "TEMPLATE DIRECTORY" section of git-init[1].)
zh_cn: 指定使用模板的目录; (参见 git-init[1] 的"TEMPLATE DIRECTORY"部分。)
